railstutch3/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @user = User.find(params[:id])

INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-12-13 01:06:22.228618"], ["updated_at", "2014-12-13 01:06:22.228618"]]
---
  def create
    @user = User.new(user_params)
    if @user.save